# Create DataFrome From Random And Csv File

In [ ]:
import pandas as pd
import numpy as np

In [5]:
data=np.random.rand(5,4)

In [6]:
data

array([[0.18715651, 0.33739127, 0.8428248 , 0.51117059],
       [0.06306364, 0.53440977, 0.36273064, 0.39591409],
       [0.76705558, 0.39933716, 0.6139582 , 0.8114836 ],
       [0.76503395, 0.79752424, 0.15897413, 0.89474738],
       [0.06489182, 0.31104159, 0.73483852, 0.69395498]])

In [15]:
s1=pd.DataFrame(data,columns=["suraj","sujan","suman","krisa"])

In [16]:
s1

      suraj     sujan     suman     krisa
0  0.187157  0.337391  0.842825  0.511171
1  0.063064  0.534410  0.362731  0.395914
2  0.767056  0.399337  0.613958  0.811484
3  0.765034  0.797524  0.158974  0.894747
4  0.064892  0.311042  0.734839  0.693955

In [17]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [18]:
s1.shape

(5, 4)

In [19]:
s1.size

20

In [23]:
s1

      suraj     sujan     suman     krisa
0  0.187157  0.337391  0.842825  0.511171
1  0.063064  0.534410  0.362731  0.395914
2  0.767056  0.399337  0.613958  0.811484
3  0.765034  0.797524  0.158974  0.894747
4  0.064892  0.311042  0.734839  0.693955

In [21]:
s1.describe()

          suraj     sujan     suman     krisa
count  5.000000  5.000000  5.000000  5.000000
mean   0.369440  0.475941  0.542665  0.661454
std    0.365526  0.199431  0.279152  0.206814
min    0.063064  0.311042  0.158974  0.395914
25%    0.064892  0.337391  0.362731  0.511171
50%    0.187157  0.399337  0.613958  0.693955
75%    0.765034  0.534410  0.734839  0.811484
max    0.767056  0.797524  0.842825  0.894747

In [22]:
s1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   suraj   5 non-null      float64
 1   sujan   5 non-null      float64
 2   suman   5 non-null      float64
 3   krisa   5 non-null      float64
dtypes: float64(4)
memory usage: 224.0 bytes

In [24]:
s1

      suraj     sujan     suman     krisa
0  0.187157  0.337391  0.842825  0.511171
1  0.063064  0.534410  0.362731  0.395914
2  0.767056  0.399337  0.613958  0.811484
3  0.765034  0.797524  0.158974  0.894747
4  0.064892  0.311042  0.734839  0.693955

In [25]:
s1["NewColumn"]="Nepal"

In [26]:
s1

      suraj     sujan     suman     krisa NewColumn
0  0.187157  0.337391  0.842825  0.511171     Nepal
1  0.063064  0.534410  0.362731  0.395914     Nepal
2  0.767056  0.399337  0.613958  0.811484     Nepal
3  0.765034  0.797524  0.158974  0.894747     Nepal
4  0.064892  0.311042  0.734839  0.693955     Nepal

In [31]:
s1["suraj"]=s1["suraj"]*3

In [32]:
s1

      suraj     sujan     suman     krisa  NewColumn
0  1.684409  0.337391  0.842825  0.511171   0.561470
1  0.567573  0.534410  0.362731  0.395914   0.189191
2  6.903500  0.399337  0.613958  0.811484   2.301167
3  6.885306  0.797524  0.158974  0.894747   2.295102
4  0.584026  0.311042  0.734839  0.693955   0.194675

In [1]:
s1

NameError: name 's1' is not defined